{
    "2.174": "TEXTURES DONE WHAAAAAAAAAAAATTTTT",
    "released":"",
    "2.175": "Initial private alpha release",
    "2.176": "I added saws to the editor, and the ability to toggle wether blocks should float or not, also fixed the bug where objects would freeze in the editor when changed or selected.",
    "2.177": "Added blenders, and fixed the main menu loading bug!",
    "2.178": "Added finish line, fixed the vehicle leveldata bug, made your character walk by default when no vehicle is present, fixed the zoom amount not saving properly and fixed the saw lag by removing a visual feature",
    "2.179": "Level browser now loads 5 times faster due to asynchronous loading as opposed to waiting for every thumbnail to load and then loading the next one. Breaking a leg doesn't allow you to fly high in the sky anymore. I'm sorry if I just ruined your dream. Also improved the looks of the dialog to look more similar to CW1. Nostalgia baby!",
    "2.180": "Added custom textures! (yes this took that long). I also did more patches and small changes but I honestly forgot about that.",
    "2.181": "Added fans! These are work-in-progress, which means THEY ARE NOT FINISHED YET!! Also did some texture changes here and there and fixed the mobile control not changing when ejecting and stuff bug. Also fixed a small editor bug involving the selection dropdown. (there's still a lot left lol)",
    "2.182": "Fans can now shred Cattie, Fans now have a pretty cool spinning animation, Cattie now gets fully paralyzed on death, fixed a bug where the jumping animation wouldn't be shown when not in zombies gamemode, fixed the game showing a white screen instead of a loading screen when loading audio, fixed a miniscule annoyance where a part of the stamina bar wouldn't get the sprinting effect applied showing a blank yellow corner, added a command to change the game settings, and changed the back button to a green done button for clarity. I also fixed copy pasting in the level editor. BUT I still want to get the fans working correctly, now, they pull you up and blow you away even when you're next to the fan, and I'm currently trying to implement some very complex math to fix this issue (massive thanks to derpygamer2142 for helping me with the math for this, still trying to implement it correctly (close!)).",
    "2.183": "Significantly improved performance by culling blocks that are out of view distance (this caused some bugs however), Finally finished the settings menu and added settings to it, Added a new dog character, Added a screenshot button, fixed an editor bug where setting a custom texture and then changing to the miscellaneous tab, the texture would not be cleared in the editor. Crushing should also work properly now.",
    "2.184": "Added a like/dislike button, added this functionality in the backend (painful), added like/dislike counter under each level, fixed the @config not loading correctly when starting the game, fixed the clipboard, made the clone and reset camera option in the dropdown work, technically made delete work, but this just shifts the item really far, slightly altered the look of endercat, added SEARCH functionality, performed more fixes, which I forgot about sadly, because development stretches across multiple days now… Heeev Fun",
    "2.184.1": "Added a way to sort levels by date, viewcount, like-dislike ratio and alphabet!",
    "2.184.3": "Added victory screen, fixed walking animation and added a backwards walking animation",
    "2.185": "Added organs, Added a way to sort levels by date, viewcount, like-dislike ratio and alphabet, Added victory screen, fixed walking animation and added a backwards walking animation, fixed blenders being weak and colliding with saws and blenders, fixed blood spouts staying eventhough the parent limb had been destroyed, disabled blood physics by default because it was extremely performance intensive. Also fixed a stupid!!! bug where the camera would get a seizure for a second when your chest would be destroyed",
    "2.186": "Added spinal vertebrae, added gore decals to saws and blenders, added a crushing sound, spent way too long on something that didn't work...",
    "2.187": "Added checkpoint, this stores your position and your lost limbs (I think this is a cool feature lol) and added a way to toggle wether you want the resource-intensive back vertebrae and blood vessels. Also made the music go quieter and get a reverb effect when the game is paused. Also added a bandana cosmetic (suggested by my sister). This is technically version 188 since i already released 187 but that update felt a little small.",
    "2.188": "Added groceries to the cart, the main menu now shows a random level. Made sure the stamina and/or health bar hides whenever you decide to disable terminal bleeding, fixed the leg clipping out of the cart, fixed cattie being too weak in the knees to stand upright on the scooter, fixed the restart button not restarting the level but restarting at the last checkpoint, and fixed the restart keybind not restarting from the checkpoint (wow), also fixed cattie teleporting when having his ass be destroyed. Groceries can be toggled by entering /wconf groceries <true or false>"
}